#include<bits/stdc++.h>
using namespace std;

int main()
{
	/*
	hello world 
	其实今年不怎么想来考了，这一年也一直没有继续学了
	就当过来再感受一下气氛吧 
	从2018年我高一那年学了一个月拿了省一开始，到今年2020年只写了一题，我的oi之旅就这么结束了
	高二本来是最关键的一年，但是一直因为各种活动没时间学，2019年考试之前就已经知道了结果
	高三了，早已被改造成文化课斗士（233
	oi也基本上不会了，写了个t1就当来打个卡
	时间过得真的很快
	或许现在竞赛的奖项对升学已经没有那么大帮助了，但其实还是很想拿点成绩的
	但是现在看来肯定没奖啦
	遗憾很多，遗憾也很少
	现在还有12分钟结束，人生的某一个阶段也正式结束了
	在此之后，我将要面对更纯粹的一段日子
	纯粹又几乎单调，但却不意味着枯燥
	这是茫茫众生必将经历的一个阶段
	往后的日子或许更苦，这谁也说不准
	很感谢一路上帮过我的同学，老师
	感谢你们的热心，感谢你们没有选择嘲笑我
	oi给我的一生带来的是什么，现在很难说，但是肯定是远远高于升学工具的
	很多东西可能我们并不擅长，但是却硬着头皮咬着牙去做了
	这个过程就是值得的  
	要回去继续准备高考啦
	祝愿我们都有光明的前途 
	 
	*/ 
	cout<<"HELLO,WORLD"<<endl;
	return 0; 
}
