#include<bits/stdc++.h>
using namespace std;
int n,k;



int main()
{
	freopen("walk.in","r",stdin);
	freopen("walk.out","w",stdout);
	/*小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	小C你别走出去哇
	
	*/ 
cout<<"-1"<<endl;
return 0;
}
